ARMmbed/mbed-os/targets/TARGET_Cypress/TARGET_PSoC6/device/middleware/ble/cy_ble_gatt.c
/***************************************************************************//**
* \file cy_ble_gatt.c
* \version 2.0
*
* \brief
*  This file contains the source code for the GATT API of the BLE Component.
*
********************************************************************************
* \copyright
* Copyright 2017, Cypress Semiconductor Corporation.  All rights reserved.
* You may use this file only in accordance with the license, terms, conditions,
* disclaimers, and limitations in the end user license agreement accompanying
* the software package with which this file was provided.
*******************************************************************************/


#include "cy_ble_event_handler.h"

/* C binding of definitions if building with C++ compiler */
#ifdef __cplusplus
extern "C" {
#endif /* __cplusplus */

#if (CY_BLE_MODE_PROFILE)

/***************************************
* Global variables
***************************************/
#if (CY_BLE_GATT_ROLE_SERVER)

#if (CY_BLE_GATT_DB_CCCD_COUNT != 0u)
uint8_t cy_ble_attValuesCccdMultiple[CY_BLE_CONN_COUNT][CY_BLE_GATT_DB_CCCD_COUNT + CY_BLE_CCCD_CRC_BYTE];
#endif  /* (CY_BLE_GATT_DB_CCCD_COUNT != 0u) */


/******************************************************************************
* Function Name: Cy_BLE_GATTS_ReInitGattDb
***************************************************************************//**
*
*  Reinitializes the GATT database.
*
*  \return
*  cy_en_ble_api_result_t: A function result states if it succeeded or failed with
*  error codes:
*
*  Error Codes                          | Description
*  ------------                         | -----------
*  CY_BLE_SUCCESS                       | GATT database was reinitialized successfully.
*  CY_BLE_ERROR_INVALID_STATE           | If the function is called in any state except CY_BLE_STATE_ON.
*  CY_BLE_ERROR_INVALID_PARAMETER       | If the Database has zero entries or is a NULL pointer.
*
******************************************************************************/
cy_en_ble_api_result_t Cy_BLE_GATTS_ReInitGattDb(void)
{
    cy_en_ble_api_result_t apiResult;

    if(Cy_BLE_GetState() == CY_BLE_STATE_ON)
    {
        cy_stc_ble_gatts_db_info_t dbInfoParam =
        {
            .gattDbPtr          = cy_ble_configPtr->gattDB,
            .gattDbTotalEntries = cy_ble_configPtr->params->gattDbIndexCount,
            .gattDbMaxValue     = CY_BLE_CONFIG_GATT_DB_MAX_VALUE_LEN
        };
        apiResult = Cy_BLE_GATTS_DbRegister(&dbInfoParam);
    }
    else
    {
        apiResult = CY_BLE_ERROR_INVALID_STATE;
    }

    return(apiResult);
}


/******************************************************************************
* Function Name: Cy_BLE_GATTS_WriteEventHandler
***************************************************************************//**
*
*  Handles the Write Request Event for GATT service.
*
*  \param eventParam: The pointer to the data structure specified by the event.
*
*  \return
*  cy_en_ble_gatt_err_code_t: A function returns one of the following status
*  values.
*
*  Error Codes                          | Description
*  --------------------                 | -----------
*  CY_BLE_GATT_ERR_NONE                 | Write is successful.
*
******************************************************************************/
cy_en_ble_gatt_err_code_t Cy_BLE_GATTS_WriteEventHandler(cy_stc_ble_gatts_write_cmd_req_param_t *eventParam)
{
    cy_en_ble_gatt_err_code_t gattErr = CY_BLE_GATT_ERR_NONE;

    /* Client Characteristic Configuration descriptor write request */
    if(eventParam->handleValPair.attrHandle == cy_ble_configPtr->gatts->cccdHandle)
    {
        /* Store value to database */
        cy_stc_ble_gatts_db_attr_val_info_t dbAttrValInfo =
        {
            .handleValuePair = eventParam->handleValPair,
            .connHandle      = eventParam->connHandle,
            .flags           = CY_BLE_GATT_DB_PEER_INITIATED,
            .offset          = 0u
        };

        gattErr = Cy_BLE_GATTS_WriteAttributeValueCCCD(&dbAttrValInfo);
        if(gattErr == CY_BLE_GATT_ERR_NONE)
        {
            if(CY_BLE_IS_INDICATION_ENABLED_IN_PTR(eventParam->handleValPair.value.val))
            {
                Cy_BLE_ApplCallback((uint32_t)CY_BLE_EVT_GATTS_INDICATION_ENABLED, eventParam);
            }
            else
            {
                Cy_BLE_ApplCallback((uint32_t)CY_BLE_EVT_GATTS_INDICATION_DISABLED, eventParam);
            }
        }
        cy_ble_eventHandlerFlag &= (uint8_t) ~CY_BLE_CALLBACK;
    }

    return(gattErr);
}


/******************************************************************************
* Function Name: Cy_BLE_GATTS_WriteAttributeValueCCCD
***************************************************************************//**
*
*  This function extends Cy_BLE_GATTS_WriteAttributeValue API to support 
*  storing of separate CCCD values for each (separate) connections.
*
*  This function is used to write to the value field of the specified attribute
*  in the GATT database of a GATT Server. If attribute is CCCD, the value is 
*  stored in specific CCCD storages.
*  This is a blocking function. No event is generated on calling this function.
*
*  If a peer device connected to the GATT Server initiates a write operation,
*  this function is executed on the GATT Server. During such a call, the function
*  checks for the attribute permissions (flags) before executing the write
*  operation by calling.
*
*  \param param: Parameter is of type 'cy_stc_ble_gatts_db_attr_val_info_t'.
*
* \return
*  Return value is GATT Error code specified in 'cy_en_ble_gatt_err_code_t
*
******************************************************************************/
cy_en_ble_gatt_err_code_t Cy_BLE_GATTS_WriteAttributeValueCCCD(cy_stc_ble_gatts_db_attr_val_info_t *param)
{
    cy_en_ble_gatt_err_code_t errCode;

    errCode = Cy_BLE_GATTS_WriteAttributeValue(param);

#if (CY_BLE_GATT_DB_CCCD_COUNT != 0u)
    /* Support separate CCCD value for each connection */
    if((errCode == CY_BLE_GATT_ERR_NONE) &&
       (CY_BLE_GATT_DB_ATTR_CHECK_PRPTY(param->handleValuePair.attrHandle, CY_BLE_GATT_DB_CCCD_ATTR)))
    {
        (void)memcpy((void*)&cy_ble_attValuesCccdMultiple[param->connHandle.attId]
                     [CY_BLE_GATT_DB_ATTR_GET_CCCD_IDX(param->handleValuePair.attrHandle)],
                     (void*)param->handleValuePair.value.val, (uint32_t)param->handleValuePair.value.len);
    }
#endif /* (CY_BLE_GATT_DB_CCCD_COUNT != 0u) */

    return(errCode);
}


