ARMmbed/mbed-os/targets/TARGET_Cypress/TARGET_PSoC6/device/middleware/ble/cy_ble_gatt.c
/******************************************************************************
* Function Name: Cy_BLE_GATTS_ReadAttributeValueCCCD
***************************************************************************//**
*
*  This function extends Cy_BLE_GATTS_ReadAttributeValue API to support 
*  re-storing of separate CCCD values for each(separate) connections.
*
*  This function is used to read the value field of the specified attribute from
*  the GATT database in a GATT Server. If attribute is CCCD, the value is 
*  restored from specific CCCD storages.
*  This is a blocking function. No event is generated on calling this function.
*
*  \param param: Parameter is of type 'cy_stc_ble_gatts_db_attr_val_info_t'.
*  param-> offset: not used, to be ignored
*
* \return
*  cy_en_ble_gatt_err_code_t : Return value indicates if the function succeeded or
*  failed. The following are possible error codes.
*
*  Error Codes                            | Description
*  ------------                           | -----------
*   CY_BLE_GATT_ERR_NONE                  | On successful operation
*   CY_BLE_GATT_ERR_INVALID_HANDLE        | 'handleValuePair.attrHandle' is not valid
*   CY_BLE_GATT_ERR_READ_NOT_PERMITTED    | Read operation is not permitted on this attribute
*   CY_BLE_GATT_ERR_UNLIKELY_ERROR        | Invalid arguments passed
*
******************************************************************************/
cy_en_ble_gatt_err_code_t Cy_BLE_GATTS_ReadAttributeValueCCCD(cy_stc_ble_gatts_db_attr_val_info_t *param)
{
    cy_en_ble_gatt_err_code_t errCode;

    if((param->handleValuePair.attrHandle == 0u) || (param->handleValuePair.attrHandle > CY_BLE_GATT_DB_INDEX_COUNT) ||
       (param->connHandle.attId >= CY_BLE_CONN_COUNT))
    {
        errCode = CY_BLE_GATT_ERR_INVALID_HANDLE;
    }
    else
    {
    #if (CY_BLE_GATT_DB_CCCD_COUNT != 0u)
        if(CY_BLE_GATT_DB_ATTR_CHECK_PRPTY(param->handleValuePair.attrHandle, CY_BLE_GATT_DB_CCCD_ATTR))
        {
            CY_BLE_GATT_DB_ATTR_SET_GEN_VALUE(param->handleValuePair.attrHandle,
                                              (void*)&cy_ble_attValuesCccdMultiple[param->connHandle.attId]
                                              [CY_BLE_GATT_DB_ATTR_GET_CCCD_IDX(param->handleValuePair.attrHandle)],
                                              CY_BLE_CCCD_LEN);
        }
    #endif /* (CY_BLE_GATT_DB_CCCD_COUNT != 0u) */

        errCode = Cy_BLE_GATTS_ReadAttributeValue(param);
    }

    return(errCode);
}

#if (CY_BLE_GATT_DB_CCCD_COUNT != 0u)


/******************************************************************************
* Function Name: Cy_BLE_GATTS_ReadAttributeValueCCCDReqHandler
***************************************************************************//**
*
*  This function is used to handle CY_BLE_EVT_GATTS_READ_CHAR_VAL_ACCESS_REQ
*  request and updated CCCD value in GATT database in a GATT Server for
*  multi-connection support.
*
*  \param param: Parameter is of type 'cy_stc_ble_gatts_char_val_read_req_t'.
*
* \return
*  cy_en_ble_gatt_err_code_t : Return value indicates if the function succeeded or
*  failed. The following are possible error codes.
*
*  Error Codes                          | Description
*  ------------                         | -----------
*   CY_BLE_GATT_ERR_NONE                | On successful operation
*   CY_BLE_GATT_ERR_INVALID_HANDLE      | 'handleValuePair.attrHandle' is not valid
*
******************************************************************************/
cy_en_ble_gatt_err_code_t Cy_BLE_GATTS_ReadAttributeValueCCCDReqHandler(const cy_stc_ble_gatts_char_val_read_req_t *param)
{
    cy_en_ble_gatt_err_code_t errCode = CY_BLE_GATT_ERR_NONE;

    if((param->attrHandle == 0u) || (param->attrHandle > CY_BLE_GATT_DB_INDEX_COUNT) ||
       (param->connHandle.attId >= CY_BLE_CONN_COUNT))
    {
        errCode = CY_BLE_GATT_ERR_INVALID_HANDLE;
    }
    else
    {
        if(CY_BLE_GATT_DB_ATTR_CHECK_PRPTY(param->attrHandle, CY_BLE_GATT_DB_CCCD_ATTR))
        {
            CY_BLE_GATT_DB_ATTR_SET_GEN_VALUE(param->attrHandle,
                                              (void*)&cy_ble_attValuesCccdMultiple[param->connHandle.attId]
                                              [CY_BLE_GATT_DB_ATTR_GET_CCCD_IDX(param->attrHandle)],
                                              CY_BLE_CCCD_LEN);
        }
    }

    return(errCode);
}

#endif /* (CY_BLE_GATT_DB_CCCD_COUNT != 0u) */

#endif /* (CY_BLE_GATT_ROLE_SERVER) */

#if (CY_BLE_GATT_ROLE_CLIENT)


/******************************************************************************
* Function Name: Cy_BLE_GATTC_StartDiscovery
***************************************************************************//**
*
*  Starts the automatic server discovery process. 
*   
*   Discovery procedure is based on the user configuration. It discovers only 
*    services, characteristics, descriptors which were declared in the 
*    GATT database. Discovery procedure has the following flow:
*   - discovering primary services by 
*        BLE Stack function Cy_BLE_GATTC_DiscoverPrimaryServices();
*   - discovering included services by 
*        BLE Stack function Cy_BLE_GATTC_FindIncludedServices();
*   - discovering characteristics for available services by 
*        BLE Stack function Cy_BLE_GATTC_DiscoverCharacteristicDescriptors();
*   - discovering characteristic descriptors by 
*        BLE Stack function CyBle_GattcDiscoverAllCharacteristicDescriptors();
*
*   During the discovery procedure the discovery-specific stack events are 
*   handled by the component and thus aren't passed to the application callback:
*   CY_BLE_EVT_GATTC_READ_BY_GROUP_TYPE_RSP, CY_BLE_EVT_GATTC_READ_BY_TYPE_RSP,
*   CY_BLE_EVT_GATTC_FIND_INFO_RSP, CY_BLE_EVT_GATTC_ERROR_RSP.              
*   
*   After discovering procedure all information about available services is 
*   stored in cy_stc_ble_disc_srvc_info_t structures, and discovered 
*   attributes handles are stored in service-specific client structures, 
*   such as cy_stc_ble_basc_t for Battery Service or cy_stc_ble_hrsc_t for
*   Heart Rate Service.
*                
*   The following events may be generated after calling this function:
*   CY_BLE_EVT_GATTC_DISCOVERY_COMPLETE - event is generated when the remote 
*                                         device was successfully discovered. 
*   CY_BLE_EVT_GATTC_ERROR_RSP          - is generated if the device discovery
*                                         has failed.
*   CY_BLE_EVT_GATTC_SRVC_DUPLICATION   - is generated if duplicate service 
*                                         record was found during the server 
*                                         device discovery.
*   CY_BLE_EVT_GATTC_CHAR_DUPLICATION   - is generated if duplicate service's 
*                                         characteristic descriptor record was
*                                         found during the server device 
*                                         discovery.
*   CY_BLE_EVT_GATTC_DESCR_DUPLICATION  - is generated if duplicate service's 
*                                         characteristic descriptor record was
*                                         found during the server device 
*                                         discovery. 
*
* \return
*    cy_en_ble_api_result_t : Return value indicates if the function
*                             succeeded or failed. 
*                             The following are possible error codes:
*
*   <table>
*   <tr>
*      <th>Error Codes</th>
*      <th>Description</th>
*    </tr>
*    <tr>
*      <td>CY_BLE_SUCCESS</td>
*      <td>On successful operation</td>
*    </tr>
*    <tr>
*      <td>CY_BLE_ERROR_INVALID_PARAMETER</td>
*      <td>'connHandle' value does not represent any existing entry.</td>
*    </tr>
*    <tr>
*      <td>CY_BLE_ERROR_INVALID_OPERATION</td>
*      <td>The operation is not permitted</td>
*    </tr>
*   <tr>
*      <td>CY_BLE_ERROR_MEMORY_ALLOCATION_FAILED</td>
*      <td>Memory allocation failed</td>
*    </tr>
*   <tr>
*      <td>CY_BLE_ERROR_INVALID_STATE</td>
*      <td>If the function is called in any state except connected or discovered</td>
*    </tr>
*   </table>
*
******************************************************************************/
cy_en_ble_api_result_t Cy_BLE_GATTC_StartDiscovery(cy_stc_ble_conn_handle_t connHandle)
{
    uint32_t discIdx;
    cy_en_ble_api_result_t apiResult;
    cy_en_ble_conn_state_t connState = Cy_BLE_GetConnectionState(connHandle);

