ARMmbed/mbed-os/targets/TARGET_Cypress/TARGET_PSoC6/device/middleware/ble/cy_ble_gatt.c
    if((connState != CY_BLE_CONN_STATE_CONNECTED) && (connState != CY_BLE_CONN_STATE_CLIENT_DISCOVERED))
    {
        apiResult = CY_BLE_ERROR_INVALID_STATE;
    }
    else
    {
        /* Clean old discovery information */
        uint32_t i;

        /* Register connHandle in cy_ble_discovery structure */
        apiResult = Cy_BLE_GATTC_AddConnHandle(connHandle);
        discIdx = Cy_BLE_GetDiscoveryIdx(connHandle);

        for(i = 0u; i < (uint8_t)CY_BLE_SRVI_COUNT; i++)
        {
            (void)memset(&cy_ble_serverInfo[discIdx][i].range, 0, sizeof(cy_ble_serverInfo[0][0].range));
        }
    }

    if(apiResult == CY_BLE_SUCCESS)
    {
        cy_stc_ble_gattc_read_by_group_req_t reqParam =
        {
            .connHandle = connHandle
        };

        cy_ble_discovery[discIdx].gattcDiscoveryRange.startHandle = CY_BLE_GATT_ATTR_HANDLE_START_RANGE;
        cy_ble_discovery[discIdx].gattcDiscoveryRange.endHandle = CY_BLE_GATT_ATTR_HANDLE_END_RANGE;
        reqParam.range = cy_ble_discovery[discIdx].gattcDiscoveryRange;

        Cy_BLE_ServiceInit();


        apiResult = Cy_BLE_GATTC_DiscoverPrimaryServices(&reqParam);

        if(apiResult == CY_BLE_SUCCESS)
        {
            Cy_BLE_SetConnectionState(connHandle, CY_BLE_CONN_STATE_CLIENT_SRVC_DISCOVERING);
            cy_ble_discovery[discIdx].autoDiscoveryFlag = 1u;
        }
    }

    return(apiResult);
}


/******************************************************************************
* Function Name: Cy_BLE_GATTC_StartPartialDiscovery
***************************************************************************//**
*
*  Starts the automatic server discovery process as per the range provided
*  on a GATT Server to which it is connected. This function could be used for
*  partial server discovery after indication received to the Service Changed
*  Characteristic Value. Two events may be generated
*  after calling this function - CY_BLE_EVT_GATTC_DISCOVERY_COMPLETE or
*  CY_BLE_EVT_GATTC_ERROR_RSP. The CY_BLE_EVT_GATTC_DISCOVERY_COMPLETE event is
*  generated when the remote device was successfully discovered. The
*  CY_BLE_EVT_GATTC_ERROR_RSP is generated if the device discovery is failed.
*
*  \param connHandle: The handle which consists of the device ID and ATT connection ID.
*  \param startHandle: Start of affected attribute handle range.
*  \param endHandle: End of affected attribute handle range.
*
*  \return
*    cy_en_ble_api_result_t : Return value indicates if the function succeeded or
*                             failed. The following are possible error codes.
*
*   <table>
*   <tr>
*      <th>Error Codes</th>
*      <th>Description</th>
*    </tr>
*    <tr>
*      <td>CY_BLE_SUCCESS</td>
*      <td>On successful operation</td>
*    </tr>
*    <tr>
*      <td>CY_BLE_ERROR_INVALID_PARAMETER</td>
*      <td>'connHandle' value does not represent any existing entry.</td>
*    </tr>
*    <tr>
*      <td>CY_BLE_ERROR_INVALID_OPERATION</td>
*      <td>The operation is not permitted</td>
*    </tr>
*   <tr>
*      <td>CY_BLE_ERROR_MEMORY_ALLOCATION_FAILED</td>
*      <td>Memory allocation failed</td>
*    </tr>
*   <tr>
*      <td>CY_BLE_ERROR_INVALID_STATE</td>
*      <td>If the function is called in any state except connected or discovered</td>
*    </tr>
*   </table>
*
******************************************************************************/
cy_en_ble_api_result_t Cy_BLE_GATTC_StartPartialDiscovery(cy_stc_ble_conn_handle_t connHandle,
                                                          cy_ble_gatt_db_attr_handle_t startHandle,
                                                          cy_ble_gatt_db_attr_handle_t endHandle)
{
    uint32_t discIdx;
    cy_en_ble_api_result_t apiResult;
    cy_en_ble_conn_state_t connState = Cy_BLE_GetConnectionState(connHandle);

    if((connState != CY_BLE_CONN_STATE_CONNECTED) && (connState != CY_BLE_CONN_STATE_CLIENT_DISCOVERED))
    {
        apiResult = CY_BLE_ERROR_INVALID_STATE;
    }
    else
    {
        uint32_t i;

        /* Register connHandle in cy_ble_discovery structure */
        apiResult = Cy_BLE_GATTC_AddConnHandle(connHandle);
        discIdx = Cy_BLE_GetDiscoveryIdx(connHandle);

        /* Clean old discovery information of affected attribute range */
        for(i = 0u; i < (uint8_t)CY_BLE_SRVI_COUNT; i++)
        {
            if((cy_ble_serverInfo[discIdx][i].range.startHandle >= startHandle) &&
               (cy_ble_serverInfo[discIdx][i].range.startHandle <= endHandle))
            {
                (void)memset(&cy_ble_serverInfo[discIdx][i].range, 0, sizeof(cy_ble_serverInfo[0u][0u].range));
            }
        }
    }

    if(apiResult == CY_BLE_SUCCESS)
    {
        cy_stc_ble_gattc_read_by_group_req_t readByGroupReqParam =
        {
            .connHandle = connHandle
        };

        cy_ble_discovery[discIdx].gattcDiscoveryRange.startHandle = startHandle;
        cy_ble_discovery[discIdx].gattcDiscoveryRange.endHandle = endHandle;

        Cy_BLE_ServiceInit();

        readByGroupReqParam.range = cy_ble_discovery[discIdx].gattcDiscoveryRange;

        apiResult = Cy_BLE_GATTC_DiscoverPrimaryServices(&readByGroupReqParam);
        if(apiResult == CY_BLE_SUCCESS)
        {
            Cy_BLE_SetConnectionState(connHandle, CY_BLE_CONN_STATE_CLIENT_SRVC_DISCOVERING);
            cy_ble_discovery[discIdx].autoDiscoveryFlag = 1u;
        }
    }

    return(apiResult);
}


/******************************************************************************
* Function Name: Cy_BLE_GATTC_DiscoverCharacteristicsEventHandler
***************************************************************************//**
*
*  This function is called on receiving a "CY_BLE_EVT_GATTC_READ_BY_TYPE_RSP"
*  event. Based on the service UUID, an appropriate data structure is populated
*  using the data received as part of the callback.
*
*  \param discCharInfo: The pointer to a characteristic information structure.
*
* \return
*  None
*
******************************************************************************/
void Cy_BLE_GATTC_DiscoverCharacteristicsEventHandler(cy_stc_ble_disc_char_info_t *discCharInfo)
{
    uint32_t discIdx = Cy_BLE_GetDiscoveryIdx(discCharInfo->connHandle);

