ARMmbed/mbed-os/targets/TARGET_Cypress/TARGET_PSoC6/device/middleware/ble/cy_ble_gatt.c
/******************************************************************************
* Function Name: Cy_BLE_GATTC_RemoveConnHandle
***************************************************************************//**
*
*  Unregister connHandle from cy_ble_discovery structure.
*  This function removes all connHandle indexes from cy_ble_discovery structure
*  if connHandle.bdHandle parameter is set to CY_BLE_INVALID_CONN_HANDLE_VALUE.
*
* \param connHandle: The handle which consists of the device ID and ATT connection ID.
*
* \return: A function result states if it succeeded or failed with
*  error codes:
*
*  Error Codes                          | Description
*  ------------                         | -----------
*  CY_BLE_SUCCESS                       | On successful operation
*  CY_BLE_ERROR_NO_DEVICE_ENTITY        | If discovery information is absent
*
******************************************************************************/
cy_en_ble_api_result_t Cy_BLE_GATTC_RemoveConnHandle(cy_stc_ble_conn_handle_t connHandle)
{
    cy_en_ble_api_result_t apiResult = CY_BLE_SUCCESS;
    uint32_t fFlag = CY_BLE_INVALID_CONN_HANDLE_VALUE;
    uint32_t i;

    /* Remove connHandle from cy_ble_discovery structure */
    if(connHandle.bdHandle != CY_BLE_INVALID_CONN_HANDLE_VALUE)
    {
        for(i = 0u; (i < CY_BLE_CONFIG_GATTC_COUNT) && (fFlag == CY_BLE_INVALID_CONN_HANDLE_VALUE); i++)
        {
            /* fFlag shows that we found connHandle in cy_ble_discovery */
            if(cy_ble_connHandle[cy_ble_discovery[i].connIndex].bdHandle == connHandle.bdHandle)
            {
                (void)memset(&cy_ble_discovery[i], 0, sizeof(cy_stc_ble_discovery_t));
                cy_ble_discovery[i].connIndex = CY_BLE_INVALID_CONN_HANDLE_VALUE;
                fFlag = i;
            }
        }
        if(fFlag == CY_BLE_INVALID_CONN_HANDLE_VALUE)
        {
            apiResult = CY_BLE_ERROR_NO_DEVICE_ENTITY;
        }
    }
    else
    {
        /* Remove all connHandle indexes from cy_ble_discovery structure */
        (void)memset(&cy_ble_discovery, 0, sizeof(cy_ble_discovery));

        /* Update cy_ble_discovery[].connIndex with init values (CY_BLE_INVALID_CONN_HANDLE_VALUE) */
        for(i = 0u; i < CY_BLE_CONFIG_GATTC_COUNT; i++)
        {
            cy_ble_discovery[i].connIndex = CY_BLE_INVALID_CONN_HANDLE_VALUE;
        }
    }

    /* Clean old connection handle information */
    for(i = 0u; i < CY_BLE_CONN_COUNT; i++)
    {
        if(cy_ble_connHandle[i].bdHandle == connHandle.bdHandle)
        {
            cy_ble_connHandle[i].bdHandle = CY_BLE_INVALID_CONN_HANDLE_VALUE;
            cy_ble_connHandle[i].attId = CY_BLE_INVALID_CONN_HANDLE_VALUE;
        }
    }

    return(apiResult);
}

/******************************************************************************
* Function Name: Cy_BLE_GetDiscoveryIdx
***************************************************************************//**
*
*  This function returns the index of discovery structure according to connHandle.
*
* \return
*  uint8_t: index of discovery structure
*  CY_BLE_CONFIG_GATTC_COUNT: index is not found for connHandle
*
******************************************************************************/
uint32_t Cy_BLE_GetDiscoveryIdx(cy_stc_ble_conn_handle_t connHandle)
{
    uint32_t idx;
    uint32_t retValue = CY_BLE_CONFIG_GATTC_COUNT;

    for(idx = 0u; ((idx < CY_BLE_CONFIG_GATTC_COUNT) && (retValue == CY_BLE_CONFIG_GATTC_COUNT)); idx++)
    {
        if(cy_ble_connHandle[cy_ble_discovery[idx].connIndex].bdHandle == connHandle.bdHandle)
        {
            retValue = idx;
        }
    }

    return(retValue);
}

#endif /* (CY_BLE_GATT_ROLE_CLIENT) */
#endif /* defined(CY_BLE_MODE_PROFILE) */
#ifdef __cplusplus
}
#endif /* __cplusplus */


/* [] END OF FILE */
